[
    {
        "id": "azbxg8",
        "post": " I see this quite often, a post hitting 0 within the first few hour or so of it being posted because some dickhead doesn't like the genre of music/movie/whatever they're looking for and decided to downvote it.  That's not the point of this subreddit.  If you aren't into what they're into then just don't comment and move on.  Come on, guys.  The whole point of this sub is letting anyone explore art and whatnot they haven't explored yet.  Don't be a dick.",
        "postTitle": "PSA: STOP DOWNVOTING POSTS JUST BECAUSE YOU DON'T LIKE WHAT THEY'RE LOOKING FOR",
        "bestcomment": [
            "related: people downvoting answers because theirs is supposedly better. I've upvoted all the answers to one of my questions, only to check back in a bit to see them all with one point.\n\nalso related: PLEASE UPVOTE POSTS even if you have no suggestions, or the person may never get suggestions. Posts here rarely reach my home feed because they have one or two points.",
            "King Crimson, Saba, Orville Peck, *Hunt for the Wilderpeople*. ",
            "Also respond the suggestion, giving feed back is helpful. ",
            "Is this actually a problem on this sub? It sucks but is quite hilarious ",
            "Better question:\n\nGive several examples of what you like that are somewhat related. \n\nIf you’ve run into stuff that should be related but you don’t like say that too. \n\nEg:  I really liked “fogarty’s cove” but don’t like “the badger drive”\n\nEg:  I liked everything on “Night Drive” but all the other albums have only one decent track”\n\nProviding links to examples helps too. ",
            "It happens in every sub. Post something in any sub and pay attention once it starts getting some upvotes. Spend a minute or two refreshing it and watch the number of upvotes change in real time. It's crazy. Tons of people just fucking downvote for no reason at all. ",
            "I downvote all posts that give preferences that are way too broad.\n\n*IIL Metallica, Run DMC, Elton John, Stephen King, Grey's anatomy and the colour orange, WEWIL?*\n\nUgh....",
            "I only downvote posts where the person posts like 3 or 4 completely unrelated things in the title.\n\nEg: IIL Radiohead, Pink Floyd, Drake, and Arctic Monkeys, WEWIL?\n\nLike congrats you enjoy four popular artists that have nothing in common, here's a suggestion for 5 more acclaimed musicians. ",
            "I sort by controversial and upvote posts undeserving of a 0.\n\nSome people are just too stupid.",
            "I do this every time I see someone say \nCage the elephant glass animals arctic monkeys etc. WEWIL\n\nThere are 100 posts asking the exact same question, it isn’t only because people don’t like the music. "
        ]
    },
    {
        "id": "7esu74",
        "post": "",
        "postTitle": "[IYL] a free and open internet, [YML] protecting Net Neutrality",
        "bestcomment": [
            "I think this is my favourite Net Neutrality post title.",
            "Copied from another sub. Don't mind me\n\nThese are the emails of the 5 people on the FCC roster. These are the five people deciding the future of the internet.\n\nThe two women have come out as No votes. We need only to convince ONE of the other members to flip to a No vote to save Net Neutrality.\n\nBlow up their inboxes!\n\nAjit Pai - Ajit.Pai@fcc.gov\n\nMignon Clyburn - Mignon.Clyburn@fcc.gov\n\nMichael O'Reilly - Mike.O'Reilly@fcc.gov\n\nBrendan Carr - Brendan.Carr@fcc.gov\n\nJessica Rosenworcel - Jessica.Rosenworcel@fcc.gov\n\nSpread this comment around! We need to go straight to the source. Be civil, be concise, and make sure they understand that what they're about to do is UNAMERICAN.\n\nGodspeed!"
        ]
    },
    {
        "id": "5mrrlo",
        "post": "Grow up!\n\n(Weeknd is used as an example)",
        "postTitle": "Hey, if you downvote posts because you think you have better tastes and that other people don't deserve to find music similar to The Weeknd, you are a dick.",
        "bestcomment": [
            "It's unfortunately somewhat of a problem here. No idea why people even bother downvoting someone for their taste, especially in a subreddit like this one where people are just looking for recommendations.",
            "I agree with what's being said, but similarly, I see a lot of posts where the OP hasn't searched the subreddit already. chances are if you want music similar to a very popular artist, there have been multiple threads that covered it. if none of them matches what you're looking for, by all means make the thread but address that you've searched beforehand so people won't give you the go-to recs",
            "does downvoting a post in this sub mean nobody will every see it? just curious",
            "I usually never downvote anyone.\nI only upvote if i find that post/comment useful, interesting, funny or else.\nIf i'm not interested in a thread i just ignore it",
            "Is that a thing that actually happens? I normally just upvote posts here if its something relevent to me",
            "I don't know how active the mods are here and how much control they actually have when it comes to modifying this sub, but isn't there an option of disable downvotes on posts from the sub? I've seen other subs where it was only possible to upvote posts and I feel like that would be a decent trend to follow on this sub. If you don't like a request asked will you just move on and you don't have the ability to not have said request seen because of downvoting. \n",
            "Is this why my post didn't get any upvotes :(",
            "I'll just be frank; I do downvote posts here sometime, but usually only if A. the artist/band in question has been requested here multiple times B. I REALLY dislike the artist/band (Bieber for example) C. it's really simple to find similar music to the artist/band in question (usually in conjuction with B).",
            "I never up vote or downvote requests in this sub. I upvote responses that I think are good and well thought out and I downvote responses that are nonanswers. \n\nIf I see a request and the person likes something I don't or am not familiar with I just don't answer it because I'm not going to be any help",
            "If you make a post like this, you’re a whiny bitch."
        ]
    },
    {
        "id": "1isggt",
        "post": "",
        "postTitle": "[IYL] Piña coladas, [YML] getting caught in the rain",
        "bestcomment": [
            "[IYNI] Yoga, [YMBI] champagne.",
            "[IYL] Fat-bottomed girls, bicycle races, [YWL] Jaws, Star Wars, Peter-Pan, Frankenstein, or Superman.",
            "What the fuck is going on here.",
            "Upvote for truth. I have been caught in the rain many, many times, and always enjoy it thoroughly. However, I'd somehow never had a piña colada before. But last week I attended a tropical themed wedding. There were piña coladas being served, so I thought, \"what the hell, why not?\"\n\n  Ladies and gentlemen, let me tell you. It was pretty tasty.",
            "That crafty Rupert Holmes... Using viral marketing to get the kids into his music...",
            "Shrek is love shrek is life",
            "You're nobody's poet, but that wasn't half bad. ",
            "funny motherfuckers these redditors",
            "You've had a stroke of genius.  This will be the best day of your life.\n\n\n*Welcome to reddit you will do well here.",
            "Maybe it's just me, but please keep this kind of circle jerking out of r/ifyoulikeblank"
        ]
    },
    {
        "id": "e9m6wf",
        "post": "Just as we said in a recent thread, this sub is opening up for every single post to be someone saying IYL ambient stuff here’s a playlist I made in two seconds from Spotify’s suggested songs. \n\nThis is one of the best lesser known subs on reddit because hearing someone’s suggestions from a completely obscure or potentially local artist they discovered keeps it authentic. \n\nEvery third post is now just someone posting their Spotify link to a playlist that anyone else who owns a Spotify account can make themselves based off one song and it’s suggested counter parts. There is a subreddit for this and it’s called r/listentothis",
        "postTitle": "MODS can we please get a ban on just shamelessly promoting self made Spotify playlists?",
        "bestcomment": [
            "I thought I was the only one.\n\nI think playlists have their place here, but it should be as an actual recommendation rather than some sort of clickbait submission.",
            "Yeah, I agree. They're already a cancer on r/spotify and r/music even. But I wouldn't say r/listentothis is meant for them either.",
            "Those who object need to realize that these days successful spotify playlists can be monetized (even if only for a few pennies). Whenever money is involved it results in spam and if we don't do something about this now the problem will only get worse and worse.",
            "I agree with banning them as submissions so long as they can still be linked in replies.",
            "I must be weird, I’ve never submitted a Spotify playlist, but I have come across a lot on here that I’ve enjoyed listening to and even followed",
            "I'd really like to see more moderation here in general. There are tons of low-effort posts of just \"here's a list of a 10 quite popular bands I like that have little in common with each other\".\n\nAs a start, I wish there was at least a rule saying you have to say *what* you like about them, to 1) filter out the \"I'm lazy and can't be arsed to put in even the tiniest bit of effort to finding new music/movies/games\" posts, and 2) actually give commenters something to go off of.",
            "I always wanted to start a thread titled \"If you like free karma, try making a spotify list with these bands on it and posting it here\".  You know, for the free karma.\n\nI always thought this sub was more for people asking questions and getting answers, not folks \"proactively\" answering questions that someone, somewhere might be thinking.\n\nI'm all for banning this crap.",
            "100% agree!",
            "Yeah, I just found this sub a couple of weeks ago and it's EXACTLY what I've been looking for! I've found so much new music already, I love it. \n\nI mistakenly thought r/music was going to be like this  lol. \n\nWhat I've been doing is skipping over the Spotify playlists but it would certainly be nice to not end up flooded with these. \n\nA day for Spotify playlists does sound like it would make a good compromise. What's that saying, compromise makes the dream work or whatever.",
            "As much as I enjoy some of the playlists I don't like the thought that it is on this subreddit where I enjoy more personalised music"
        ]
    },
    {
        "id": "bg1co0",
        "post": "What final song would you turn on to make a good moment out of a bad situation?\n\n&#x200B;\n\nI'm looking for songs that sort of surreal and maybe have a sad, but also positive vibe too them, not sure what that would be called.",
        "postTitle": "Songs you would listen to after you fell off the space ship, drifting into space forever, and you have finally accepted your fate.",
        "bestcomment": [
            "Space song by Beach House",
            "Ladies and Gentleman We are Floating in Space - spiritualized",
            "Exit Music for A Film by Radiohead\n\nThis is the song I'd like to die in space to",
            "Comfortably Numb\n\nAll of Wish You Were Here",
            "How to Disappear Completely by Radiohead",
            "M83 - Outro",
            "[Tame Impala - Let it happen](https://youtu.be/pFptt7Cargc)",
            "Anything by Tycho",
            "This is the Place - Naive Melody by the Talking Heads",
            "Something by sigur ros"
        ]
    },
    {
        "id": "ams6jj",
        "post": "I enjoy helping people out, so I subscribed to this sub. But I’ve found that very few people respond to comments in their threads, and almost no one reports back after checking out the recommendations.\n\nIf you want the sub to flourish, the regular users should feel that they aren’t throwing slips of paper into the void. We like to help people, but it can be encouraging and inspiring to, you know, actually know whether we helped you. \n\nGive some feedback! Interact! People will go above and beyond for you! \n\nJust a thought. ",
        "postTitle": "[meta] [IYL] this sub, please consider actually interacting with your own threads.",
        "bestcomment": [
            "This is definitely an irritating phenomenon.  I'd say I get replied to about 50% of the time I recommend something on here, which is probably higher than other subreddits, but in this one people are specifically asking for your help, then ignoring it when you give it, which is annoying.  I agree with your sentiment, but new users come around all the time & I don't think they're ever gonna see this post or others like it.  I know I personally try to respond to everyone that gives me a recommendation.",
            "r/mildlyinfuriating\n\nJust kidding, I agree with what you’re saying",
            "Totally agree.",
            "Once had someone reply to my recommendation and suggest other artists I might like that they found in the process. Only happened once. But I was totally stoked on it. ",
            "Yep, but I don't expect much from anyone any more. I only post when I feel like it and hopefully that helps someone out there somewhere.",
            "i don't really expect a reply due to this, but at least an upvote sometimes would be nice lol ",
            "I definitely try my best to reply to recommendations, though some are more detailed than others",
            "This should be a sticky. ",
            "+1.  \n\nI was inadvertently was part of that problem.  I delayed over a week to respond to a recent thread i started but did get back.  \n\nIt is good to know we're being heard.  Will respond more quickly in future\n\n",
            "Man, I’ve been meaning to post something about this myself. It’s disgraceful to see an OP just ignore dozens of quality responses, and it seems to happen on most threads.\n\nA potential solution is to do what they do in /r/cmv and automatically delete threads where there OP doesn’t respond within x amount of time."
        ]
    },
    {
        "id": "8z35pb",
        "post": "",
        "postTitle": "If I like the \"dun dun\" from Law and Order, what else might I like?",
        "bestcomment": [
            "The two timpani notes at the end of the Final Jeapordy music.",
            "the inception bwong",
            "Check out Netflix’s dun dun",
            "Brian Eno-Opening theme for Windows. \n\nOr Slayer. ",
            "[THX](https://youtu.be/FWkJ86JqlPA)",
            "That big drum sound when they show the LOST logo at the end of an episode",
            "Dungeon levels from Super Mario Bros 3 might be up your alley.  Check out airship sequences as well.",
            "Age of Empires II [barracks](https://youtube.com/watch?v=dq2g5srlv7w), [siege workshop](https://youtube.com/watch?v=9tgZqnDLYdU), [tower](https://youtube.com/watch?v=HaaoloG5D3E)",
            "\"Sit, Ubu, sit! Good dog!\", followed by the sound of a bark. ",
            "Maybe you like the ! sound"
        ]
    },
    {
        "id": "cd63uj",
        "post": "To clarify, I’m not looking to be teased with more minute-long stretches of awesomeness. What songs just stay in full on rocking out mode for a long time?\n\nAnd for the uninitiated: https://youtu.be/JDG2m5hN1vo?t=03m02s\n\nEdit: this is amazing. I’m getting so much good music. Thank you! \n\nIf anyone else shows up, I’ve discovered that part of what gets me going is an intense and DEEP bass line. Recommendations on that particular detail are much appreciated!",
        "postTitle": "I could listen to the crescendo of Fleetwood Mac’s “The Chain” for hours, but it’s only 90 seconds long. What other band/album/song will give me that fix?",
        "bestcomment": [
            "Godspeed You! Black Emperor. Crescendos that sometimes last for literally tens of minutes",
            "Man I get it with \"The Chain\". I've actually been hooked on that song recently. I remember growing up I thought Fleetwood Mac was kind of tame, but damn that song is powerful. My favorite version is the 1982 live in L.A., so raw.\n\nI also love songs that tease and build like that. You should check out \"The Lonesome Crowded West\" by Modest Mouse. There's several songs on there you might like. It's one of their first albums and it's often overlooked. \n\nAlso \"Lazy Eye\" by the Silversun Pickups kicks in at about 2:40 and it's beautiful.",
            "Check out the Currents album by Tame Impala. They have a very Fleetwood Mac kind of feel and there are a lot of powerful moments.",
            "Only in Dreams by weezer has a good buildup. It starts at around 5 minutes but unfortunately also only lasts about 2 minutes. Still a blast while it’s happening though! https://youtu.be/4spkVX8z-vs",
            "IMO, A lot of rock music from the 70s. Including \"Maggie May\" by Rod Stewart, \nA lot of songs by Pink Floyd, like the Saxophone playing in \"US and them\" about 1-2 full minutes. Or the 15 minute or so beginning to \"Shine on you crazy diamond.\" Boston was mentioned already, the Doors have a lot of songs where the music is more of the focus, than the lyrics, and finally \"Layla\" by Derrick and the Dominos,  the last three minutes or so that is just instrumental is great. I'm sure there's many other examples.",
            "[Echoes](https://youtu.be/53N99Nim6WE), Pink Floyd. It really picks up at 6:00 through 11:00 and runs to 23:35  on the album version. There are longer cuts around too.",
            "[Interpol - The New](https://www.youtube.com/watch?v=DhRYopKTdKA)  \nThere is a big build up from 2:23 - 3:17 and then from 3:17 on it's full rocking out mode.",
            "If you want long rock songs below are the first that come to mind, there's still a build up but the peak lasts a lot longer.\n\n[Lynyrd Skynyrd - Free Bird](https://www.youtube.com/watch?v=D0W1v0kOELA)\n\n[Led Zeppelin - In My Time of Dying](https://www.youtube.com/watch?v=zreiZAM7TSQ)",
            "The buildup at the beginning of I Will Possess Your Heart by Death Cab for Cutie is pretty damn good, especially live. Listen to the 8 minute version for the longer buildup instead of the 4 minute one.\n\nAlso if u just want any kind of crescendo in any genre, Adagio for Strings composed by Samuel Barber is fucking nuts.",
            "The piano ending of Layla"
        ]
    },
    {
        "id": "bq3h38",
        "post": "Ever feel like you want to get into a genre, but don't know where to start? I gotchu!\n\n&#x200B;\n\n[Spotify](https://open.spotify.com/user/21ccavqrh37bmu2mode4wyzdi?si=SXoAxZiqQJ62Dy6qWD58Vg) | [Deezer](https://www.deezer.com/profile/2236084444/playlists) | [Soundcloud](https://soundcloud.com/timothy-walschaerts/sets) | [YouTube](https://www.youtube.com/channel/UCPmDHX0C6i2ix9N49yavAzw/playlists?view_as=subscriber)\n\n&#x200B;\n\nI recommend listening on Spotify. The other sites are auto-synced with it but don't convert all songs.\n\n&#x200B;\n\nThese playlists were meant to include the classics and my personal favorites for each genre. I also tried to make a fun cover thumbnail for each one.\n\n&#x200B;\n\nSo, if you want to get into new genres, or listen to some great tracks of a genre you already enjoy, please check it out! These are still being updated from time to time and a few more playlists might be added in the future. Suggestions are always welcome!",
        "postTitle": "[IYL] getting into new music genres, [YML] these 150+ genre starter playlists",
        "bestcomment": [
            "Great work dude! Post it in r/listentothis under “discussion” tag. More people need to see this. Thank you.",
            "Extraordinary collection, an invaluable resource for people to discover new genres for years to come.  Here are a few more classics for you to consider to make the lists even stronger. Thanks again man!\n\n&#x200B;\n\nCOUNTRY:\n\n&#x200B;\n\nThe Charlie Daniels Band - The Devil Went Down to Georgia\n\nRonnie Milsap - I Wouldn't Have Missed It For the World\n\nTom T. Hall - Old Dogs, Children, and Watermelon Wine\n\nWaylon Jennings - Mama's Don't Let Your Babies Grow Up to Be Cowboys\n\nGlen Campbell - Rhinestone Cowboy\n\n&#x200B;\n\nHonorable Mention: Dottie West - Country Sunshine\n\n&#x200B;\n\nTRANCE:\n\n&#x200B;\n\nHumate - Love Stimulation (Paul van Dyk's Love Club Mix)\n\nATB - Ecstasy\n\nOrbital - Halcyon On and On\n\nSela & Briggs - This Day Will Come (Paul Webster Remix)﻿\n\nUnderworld - Born Slippy\n\n&#x200B;\n\nHonorable Mention: The Thrillseekers Feat Sheryl Deane - Synaesthesia\n\n&#x200B;\n\nTRAP RAP:\n\n&#x200B;\n\nMigos - Bad and Boujee\n\nTrippie Redd - Dark Knight Dummo\n\nSki Mask the Slump God ft. xxxtentacion - Take a Step Back\n\nPlayboi Carti x Lil Uzi Vert - Woke Up Like This\n\nxxxtentacion - Moonlight\n\n&#x200B;\n\nHonorable Mention: Juice WRLD - Lucid Dreams",
            "Oef nederlandse muziek",
            "You listen to a lot of music...",
            "Somebody posted a website here that gives you this giant graph filled with genres and then you click on it to play a song from that genre and you can also click on it to see other artists that fit under that genre. I cant remember the name though, its bookmarked on my computer at home. I think it's called every sound at once.",
            "First this is a tremendouseffortand I commend you for it. But your trap rap playlist leaves a lot to be desired. There's like 4 songs by logic for one, and a lot of trap Staples completely absent. Three six mafia and Future for example. Logic is good I guess for introducing people, but he isbt really representative of the genre other than taking trap beats and sanitizing them of anything controversial",
            "No doom metal",
            "The thumbnails look great dude",
            "Trip Hop without Nightmares on Wax? smh\n\nJust messing with you, this is excellent work. Is it an ongoing project?\n\nI would nitpick some of your House classifications (Avicii & Tiesto in Electro House?), and add number of styles of House, but that's what I'm most into, so... I could go on all day about House music alone",
            "This is amazing, followed like 10 of your playlists. Love your organization. I'm not fully done yet, but I've done something similar in [Spotify](https://open.spotify.com/user/1287686003?si=LoGtal01RcKfr01coIfTAw) using [Google Sheets](https://docs.google.com/spreadsheets/d/1sxiOcMO1fZvMGnCwrLtTuWltflVr2CJ4-g6f-mgVpo8/edit?usp=sharing) to better organize it all."
        ]
    }
]